app/Controllers/UserCrud.php

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function index(){
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `users` (`nombre`, `email`) VALUES ('Marlene', 'marle@gmail.com')
---
    public function store() {
        $userModel = new UserModel();
        $data = [
            'nombre' => $this->request->getVar('nombre'),
            'email'  => $this->request->getVar('email'),
        ];
        $userModel->insert($data);